# Pandas
- Data Analysis
- 2 types of data
    - Series Object
    - DataFrame Object

## Series 
- 1D-array
- 3 ways
    - Scalar values
    - Dictionaries
    - Nd array

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\nagaraju\anaconda3\lib\site-packages (1.0.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\nagaraju\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\nagaraju\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\nagaraju\anaconda3\lib\site-packages (from pandas) (1.18.1)
Requirement already satisfied: six>=1.5 in c:\users\nagaraju\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [4]:
#help(pd.Series)

In [6]:
x=[1,2,3,4,99,"x"]
s=pd.Series(x)
s

0     1
1     2
2     3
3     4
4    99
5     x
dtype: object

In [8]:
x=[1,2,3,4,99,"x"]
s=pd.Series(x,index=['a','b','c','d','e','f'])
s

a     1
b     2
c     3
d     4
e    99
f     x
dtype: object

## Creating Series object with dict

In [12]:
x={'x':34,"y":45,"z":32}
s1=pd.Series(x)
s1

x    34
y    45
z    32
dtype: int64

## Creating Series object with Nd arry

In [10]:
x=[[1,2,3],[4,5,6],[6,88,99]]
s=pd.Series(x)
s

0      [1, 2, 3]
1      [4, 5, 6]
2    [6, 88, 99]
dtype: object

## Creating Data Frame Object
- pd.DataFrame()
- data should be like rows and columns
- 3 ways to create
    - Dictionaries
    - one or more Series objects
    - 2D-nd arrays

In [18]:
x1={'a':23,"b":34,"c":78}
d1=pd.DataFrame(x1,index=[1])
d1

    a   b   c
1  23  34  78

In [20]:
x1={'a':23,"b":34,"c":78}
x2={'a':45,"b":67,'c':36}
d={'v1':x1,"v2":x2}
d1=pd.DataFrame(d)
d1

   v1  v2
a  23  45
b  34  67
c  78  36

## Create dataframe object with Deries object

In [24]:
s1=pd.Series([1,3,6,7])
s2=pd.Series([6,9,85,5])
d2={'x1':s1,"x2":s2}
d=pd.DataFrame(d2)
d

   x1  x2
0   1   6
1   3   9
2   6  85
3   7   5

## Accessing Elements

In [27]:
s=pd.Series([1,2,4,8,"dfg"])
d=pd.DataFrame({"name":["rgukt","pvp","ssit"],"age":[4,8,9],
                "gender":['m','m','f']})
print(s)
print(d)

0      1
1      2
2      4
3      8
4    dfg
dtype: object
    name  age gender
0  rgukt    4      m
1    pvp    8      m
2   ssit    9      f

In [28]:
d

    name  age gender
0  rgukt    4      m
1    pvp    8      m
2   ssit    9      f

In [34]:
print(s)
print(s.index)
print(s.values)

0      1
1      2
2      4
3      8
4    dfg
dtype: object
RangeIndex(start=0, stop=5, step=1)
[1 2 4 8 'dfg']

In [38]:
d

    name  age gender
0  rgukt    4      m
1    pvp    8      m
2   ssit    9      f

In [39]:
d.index

RangeIndex(start=0, stop=3, step=1)

In [40]:
d.values

array([['rgukt', 4, 'm'],
       ['pvp', 8, 'm'],
       ['ssit', 9, 'f']], dtype=object)

In [54]:
d['name'][0]# columns,rows

'rgukt'

In [55]:
d['gender'][1]

'm'

In [61]:
d['name'],d['gender']

(0    rgukt
 1      pvp
 2     ssit
 Name: name, dtype: object,
 0    m
 1    m
 2    f
 Name: gender, dtype: object)

In [68]:
d[:1]

    name  age gender
0  rgukt    4      m

In [71]:
print(d)
d[1::2]

    name  age gender
0  rgukt    4      m
1    pvp    8      m
2   ssit    9      f

  name  age gender
1  pvp    8      m

In [72]:
d[::2]# first and last rows

    name  age gender
0  rgukt    4      m
2   ssit    9      f

In [76]:
d[::-3]# getting the last row

   name  age gender
2  ssit    9      f

## loc[rows:columns]
    -loction of row and columns==>lables
## iloc[indexof row:index column]
    -index location of rows and columns==>index postion

In [77]:
d

    name  age gender
0  rgukt    4      m
1    pvp    8      m
2   ssit    9      f

In [79]:
d.loc[0]# oth rows

name      rgukt
age           4
gender        m
Name: 0, dtype: object

In [81]:
d.loc[:,"name"]# :is includeing rows

0    rgukt
1      pvp
2     ssit
Name: name, dtype: object

In [84]:
d.loc[:,'gender']

0    m
1    m
2    f
Name: gender, dtype: object

In [90]:
# getting 1st column and last columns
d.loc[:,'age'::]

   age gender
0    4      m
1    8      m
2    9      f